app/views/posts/index.html.erb

SELECT "authors".* FROM "authors"
---
<% if !params[:author].blank? %>

SELECT "posts".* FROM "posts" WHERE (created_at >= '2018-08-07 00:00:00.000000')
---
    <% if params[:date] == "Today" %>
      <% @posts = Post.where("created_at >= ?", Time.zone.today.beginning_of_day) %>